{"pages":[{"text":"What are merge stories? Merge stories are stories about contributions that people have made to free and open source projects . They give details about the process: how people pick issues to work on, the common obstacles they run into, the resources they use to solve problems, and more. We hope that by sharing these stories, we can give newcomers a better sense of what contributing is like. There are some other benefits to submitting a story. Writing out what you did to make a contribution can help you remember what you learned later. Spelling out the details of your process can help people making similar contributions when they get stuck. And by submitting stories, you can create a record of the work you've done beyond a list of commits. Who can contribute? Anyone! You do not need to be a coder or a seasoned open source contributor to submit a story. We want to see all kinds of stories represented here, from typo fixes to translation efforts, epic refactorings to event organizing. We plan to share this site at events for newcomers such as Open Source Comes to Campus , so stories from people who are just beginning in open source are especially welcome. The best stories are those which give a lot of detail and talk about the mistakes you made, not just the successes you had. Everyone, even people who've been contributing for decades, make mistakes sometimes. Why not share yours, so we can all learn from them? How is it licensed? All stories contributed to MergeStories are licensed CC BY-SA 4.0 . This means that anyone can use them for any purposes, as long as they attribute the original author and share their changes under the same terms. Who made MergeStories? MergeStories was conceived of by Shauna Gordon-McKeon and designed and developed with the help of Asheesh Laroia . It is a project of OpenHatch . Other contributors include: Paul Tagliamonte How can I help? Anyone is welcome to contribute! (Fair warning: we will definitely ask you to write a merge story about your contribution.) The project repository can be found on Github . You can follow the instructions in the README to set up the project locally and look for issues to work on in the issue tracker . Please leave a comment when you start working on an issue, and say hello in our IRC channel , #openhatch on Freenode.","tags":"pages","loc":"http://localhost:8000/pages/About.html","title":"About MergeStories"},{"text":"window.onload = (function() { for (var i=0; i < 20; i++) { var element = document.getElementById(i); // For each element in the loop, get the step with that ID # if (element === null) { // If the element doesn't exist somehow, skip the rest of the for loop. continue; } if (i != 0) { element.style.display=\"none\"; // If it's the first element, don't hide it. } var next = document.getElementById(i+1); // Get the next element, and if it's not null... if (next === null) { continue; } var textareas = element.getElementsByTagName(\"textarea\"); // Find its textarea. for (var j = 0; j < textareas.length; j++) { // There should only be one, this is a bit of a hack. var textarea = textareas.item(j); textarea.onkeyup = (function(e) { // Create an anonymous function which displays the next item when the textarea of the current item is changed. return function() { e.style.display=\"block\"; }; })(next); }; }; }) Have you ever made a contribution to an open source project? Tell us about it here. Don't be shy - no contribution is too small. And contributions involving mistakes, confusion, and trying ten different things until something works? Are the best for others to learn from. If you're not sure what to write, check out this example story or browse through the other contributions. Please try to give as much detail as you can. Questions marked with an asterisk are required. The Basics What is your name? * If you've submitted a story before, use the same name and readers will be able to see all of your stories together. This is a required question What is your email address? * This is for the administrators, in case they have questions for you. It won't be included in the post. This is a required question What project did you make a contribution to? * This is a required question What should we title your story? * If you've got writer's block, try rephrasing the name of the issue you responded to. This is a required question The Story You can add up to 20 steps, but only the first step is required. You can leave the last step blank. Here are some example questions to help you write your story. How did you learn about the project? How did you find the issue you worked on? Why did you decide to work on it? Did you talk to anybody who works on the project? Did you need to set up a development environment? How did you do so? How did you figure out where to make your changes? How did you test the changes you made? How did you contribute your changes back to the project? What difficulties did you run into, and how did you solve them? Did you turn to any communities or online resources for help? What did you need to already know to make your contribution, that someone new to open source or software projects in general might not know? The First Step * This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Next Step This is a required question The Last Step This is the last step our form will accept. If you want to write more, submit the story and email us with the rest! This is a required question Finishing Up Is your contribution displayed anywhere, for instance in a pull request? If so, you can put a link to it here. This is a required question You can suggest some tags for your story, separated by commas. We can also add tags for you. View the full list of tags here: http://mergestories.com/tags.html This is a required question By submitting your story, you agree to license it as CC BY-SA 4.0 .","tags":"pages","loc":"http://localhost:8000/pages/Submit.html","title":"Submit"},{"text":"I discovered, through reading the Debian wiki, that there was a new web app created for Debian called Debexpo, and it was nearly ready to replace our existing package review tool, but not quite ready. I took it upon myself to: Email the original authors of the code Talk to prospective users on IRC Work on it a lot at the yearly Debian conference in 2011 -- I already planned on going, and instead of just socializing, I used the Debconf hack lab space to work on this. Transition it to a different community that now maintains it -- I did this by intentionally making contribution really easy, and then repeatedly asking for help on the debian-mentors email list. All in all, I had a fun time. It is always a pleasure to help Debian. I learned a lot about the Pylons web framework as a result, which I mostly learned through massive Googling. Relevant links: Project website","tags":"misc","loc":"http://localhost:8000/reviving-debexpo.html","title":"Reviving debexpo"},{"text":"This is another test page.","tags":"misc","loc":"http://localhost:8000/third-test-post.html","title":"Third Test Post"},{"text":"This is another test page.","tags":"misc","loc":"http://localhost:8000/a-sixth-post.html","title":"A Sixth Post"},{"text":"","tags":"misc","loc":"http://localhost:8000/second-test-post.html","title":"Second Test Post"},{"text":"This is a great post that is why we are featuring it.","tags":"misc","loc":"http://localhost:8000/featured-test-post.html","title":"Featured Test Post"},{"text":"","tags":"misc","loc":"http://localhost:8000/this-is-a-fifth-test-post.html","title":"This is a fifth test post"},{"text":"","tags":"misc","loc":"http://localhost:8000/fourth-test-post.html","title":"Fourth Test Post"}]}